{
    "aliases": "Robin\nNightwing\nBatman\nThe World''s Greatest Acrobat\nThe Target\nRobbie Malone\nRenegade\nThe Boy Wonder\nAgent 37\nMr. Sparrow\nLyle Dixon\nGray Son\nGray Son of Gotham\nSpy Wonder\nRock McGinn\nRobert McGinn\nDeadman\nDoctor Daedalus\nBirdwatcher\nFaceless Savior\nAlmanqidh Majhuli Alhuia\nRic Grayson\nMayor Grayson",
    "api_detail_url": "https://comicvine.gamespot.com/api/character/4005-1691/",
    "creators": [
        "Bill Finger",
        "Bob Kane",
        "Jerry Robinson"
    ],
    "deck": "As the first Robin, Dick Grayson was the most famous sidekick in comic book history. As he ventured forth on his own, he formed the Teen Titans and became their leader. When the boy became a man, he became the independent hero known as Nightwing.",
    "description": "Dick Grayson: The Boy WonderThe Flying Graysons!Born to a family of acrobats, Dick Grayson began his life with an exciting childhood growing up in the circus. With his parents, John and Mary Grayson, his family forms \"The Flying Graysons,\" famed trapeze artists and acrobats.These happy times soon take a turn for the worse, as the mafia begins targeting the circus. At eight years old, Dick witnesses mob boss Anthony Zucco threatens the circus owner, demanding insurance for the safety of his performers. The owner vehemently refuses the extortion and Dick goes along his way. Unfortunately, Zucco decides to use the headlining act, which happens to be The Flying Graysons, as an example.As the Graysons plummet to earth, hundreds of spectators watch in horror. Among them are billionaire Bruce Wayne (also known as Batman). Feeling empathy for the boy''s loss, Bruce decides to take the boy in as his legal ward, as none of Dick''s family wanted him. The major difference between Bruce and Dick is t",
    "first_appeared_in_issue": "Introducing Robin, The Boy Wonder",
    "image": "https://comicvine1.cbsistatic.com/uploads/scale_medium/10/100647/6436335-nightwing%2041.jpg",
    "name": "Dick Grayson",
    "real_name": "Richard John Grayson-Wayne"
}