{
    "character_credits": [
        "Archon Z''gmora",
        "Barry Allen",
        "Batman",
        "Beast Boy",
        "Cyborg",
        "Dick Grayson",
        "Donna Troy",
        "Green Arrow",
        "Hal Jordan",
        "Katar Hol",
        "Matter Master",
        "Raven",
        "Ray Palmer",
        "Sargon the Sorcerer",
        "Silas Stone",
        "Starfire",
        "Superman",
        "Wally West",
        "Wonder Woman"
    ],
    "cover_date": "1980-10-31",
    "description": "3 Big First AppearancesThis issue features the first appearances of Starfire, Cyborg and Raven.Between Friend and Foe!Green Lantern relieves Superman on monitor duty. Almost immediately after Superman departs, Green Lantern receives a distress call from Archon Z''Gmora, the Green Lantern of Cygnus. After reciting his oath, while charging his power ring, Green Lantern follows Z''Gmora''s distress beacon into another dimension. Z''Gmora beckons Green Lantern to come ever closer to him. Suddenly, Green Lantern hears the dying warning of the true Z''Gmora coming from another asteroid. The impostor drops the illusion of his disguise, revealing itself as N''Gon. Before Green Lantern can react he is brought down by a single optic blast. Taking Green Lantern''s ring, N''Gon then assumes his appearance. With the power ring in his possession, N''Gon reflects on the circumstances that brought it to this dimension. Exposed to the radiation of a green star, N''Gon had been divided into two distinct, though i",
    "image": "https://comicvine1.cbsistatic.com/uploads/scale_medium/8/84205/3537405-dccp26nm9m054.jpg",
    "name": "Between Friend and Foe; Where Nightmares Begin; Whatever Happened to Sargon the Sorcerer",
    "person_credits": [
        "Adrienne Roy:colorist",
        "Ben Oda:letterer",
        "Bob Rozakis:writer",
        "Dick Giordano:artist, inker, cover",
        "E. Nelson Bridwell:editor",
        "Gaspar Saladino:letterer",
        "George Pérez:artist, penciler, cover",
        "Jerry Serpe:colorist",
        "Jim Starlin:artist, penciler, inker, cover",
        "Jose Delbo:penciler",
        "Julius Schwartz:editor",
        "Kim DeMulder:inker",
        "Len Wein:editor",
        "Marv Wolfman:writer",
        "Steve Mitchell:inker"
    ],
    "series": "DC Comics Presents"
}