{
    "aliases": "Natasha Romanoff\nNadine Roman\nNat\nTasha\nTsarina\nOktober\nLaura Matthers\nNancy Rushman\nBlack Pearl\nNatalia Shostakova\nNatuska\nCzarina\nEbon Flame\nNatalia Alianovna Romanova\nNatalie Rushman\nYelena Belova (undercover)\nNosferata (Avataar counterpart)\nThe War Widow",
    "alignment": "good",
    "api_detail_url": "https://comicvine.gamespot.com/api/character/4005-3200/",
    "appearance": {
        "eye-color": "Green",
        "gender": "Female",
        "hair-color": "Auburn",
        "height": [
            "5''7",
            "170 cm"
        ],
        "race": "Human",
        "weight": [
            "131 lb",
            "59 kg"
        ]
    },
    "creators": [
        "Don Heck",
        "Don Rico",
        "Stan Lee"
    ],
    "deck": "A former KGB agent Natasha Romanova, better known as Black Widow, is one of the best agents S.H.I.E.L.D. has ever had. She''s a longtime member of the Avengers as well as the leader of the short-lived Los Angeles-based superhero team called the Champions.",
    "description": "Not: For others that have used the name Black Widow, see: Black Widow for the Golden Age Black Widow, and Yelena Belova for the third Black Widow.OriginBlack Widow First CostumeNatalia \"Natasha\" Alianovna Romanova born circa 1928 and was raised from her youth by a Russian soldier Ivan Petrovich Bezukhov after she was orphaned when enemy soldiers attacked Stalingrad. To save Ivan''s life, she accepted a place in the Soviet government''s covert \"Red Room\" facility. While there, she was bio- and psycho-technologically enhanced - granting her an unusually long lifespan and prolonged youthful appearance. She became one of the special agents known as the Black Widow. While in the program she was trained by the Winter Soldier, and the two became lovers. Each Black Widow was deployed with false memories to help ensure their loyalty. Natasha was given memories of becoming a ballerina but eventually discovered this fact, along with the knowledge that the Red Room is still active as \"2R\".CreationBl",
    "first_appeared_in_issue": "The Crimson Dynamo Strikes Again!",
    "image": "https://www.superherodb.com/pictures2/portraits/10/100/248.jpg",
    "name": "Black Widow",
    "real_name": "Natalia Alianovna Romanova"
}