{
    "aliases": "Clint Barton\nGolden Archer\nRonin\nThe Marksman\nGoliath\nHawkeye-Kid\nCaptain America\nPurple Man\nRobin Hood\nLegolas\nHawkguy",
    "alignment": "good",
    "api_detail_url": "https://comicvine.gamespot.com/api/character/4005-1475/",
    "appearance": {
        "eye-color": "Blue",
        "gender": "Male",
        "hair-color": "Blond",
        "height": [
            "6''3",
            "191 cm"
        ],
        "race": "Human",
        "weight": [
            "230 lb",
            "104 kg"
        ]
    },
    "creators": [
        "Don Heck",
        "Stan Lee"
    ],
    "deck": "Trained by criminals and inspired by heroes, Clint Barton has grown from a troubled youth into one of the greatest heroes on Earth. The world knows him best as Hawkeye: Earth''s Mightiest Marksman. A member of the Avengers for many years, he has left the team on occasion because of team friction. But he always returns, ready to face any threat.",
    "description": "Current EventsFollowing the Marvel NOW! relaunch, Hawkeye currently appears in Avengers, Secret Avengers and his own Hawkeye book.OriginThe Master ArcherClint Barton was born into an abusive family. He and his older brother Barney were the target of an abuse from their alcoholic father (Harold) and their mother (Edith) who didn''t care. Tragedy, or perhaps poetic justice, struck when both parents died in a car accident caused by Harold''s excessive drinking.Soon after the accident, Clint and Barney were put into an orphanage. The two escaped soon after, dreaming of a better life. While on the run, the two fell in the company of a traveling circus. Needing food and shelter, Clint and Barney decided to do odd jobs for the performers.Two performers, Swordsman and Trickshot, saw potential in Clint and took him under their wing. Trickshot taught Clint archery while Swordsman taught Clint acrobatics and knife throwing. The duo became heroes to Clint as he began to surpass his masters. Though S",
    "first_appeared_in_issue": "Hawkeye, The Marksman",
    "image": "https://www.superherodb.com/pictures2/portraits/10/100/73.jpg",
    "name": "Hawkeye",
    "real_name": "Clinton Francis Barton"
}