{
    "aliases": "Jonathan Storm\r\nJohnny Storm\r\nThe Human Torch\r\nInvisible Man\r\nThe Torch\r\nMatchstick Johnny\r\nDoug Brown\r\nRyan Landau\r\nTorchie\r\nJack Richards\r\nLa Torcia Umana\r\nLa Antorcha Humana\r\nUncle Johnny\r\nPrince Morningstar\r\nFackel\r\nThe Man in the Sun",
    "api_detail_url": "https://comicvine.gamespot.com/api/character/4005-2120/",
    "creators": [
        "Jack Kirby",
        "Stan Lee",
        "Stan Lee"
    ],
    "deck": "The second most powerful member of the Fantastic Four and the younger brother of Sue Richards. Due to an accident caused by cosmic radiation in space, he can manipulate fire, turn his entire body into it and fly. While Johnny is known for his impetuous and sometimes reckless nature, he is also a loyal friend and fearless hero.",
    "description": "Note: For the Golden Age Human Torch see  Jim Hammond. He is a member of the  Invaders.OriginJohnny Storm is the son of physician Franklin Storm and his wife Mary. He and his older sister  Susan grew up in Glenville, New York. While still young, his mother was in a terrible car accident and she passed away, despite Franklin’s attempts to repair her body. After this tragic event, Franklin fell into a downward spiral of drinking and gambling, eventually leading to his arrest for the murder of a loan shark, which he claimed was self-defense. Johnny and Sue were then sent to their Aunt’s to live and Sue spend much time caring for her younger brother.As a teen, Johnny and his sister met a scientist named  Reed Richards and volunteered to go on an experimental rocket designed by Reed. The rocket would help humanity fly to the stars if everything worked as planned. But the ship was not properly shielded from cosmic radiation and plummeted back to the Earth’s surface.They all survived the horr",
    "first_appeared_in_issue": "The Fantastic Four!",
    "image": "https://comicvine1.cbsistatic.com/uploads/scale_medium/10/100647/4531254-1b0a9cbfa1742bdebed2449fc7a3d63e.jpg",
    "name": "Human Torch",
    "real_name": "Jonathan Lowell Spencer Storm"
}