{
    "aliases": "Bobby Drake\r\nDrake Roberts\r\nFrosty\r\nIceface, the Living Popsicle\r\nMr. Friese\r\nRampage\r\nRobert Louis Drake\r\nRobert Parker\r\nIceheart",
    "alignment": "good",
    "api_detail_url": "https://comicvine.gamespot.com/api/character/4005-1464/",
    "appearance": {
        "eye-color": "Brown",
        "gender": "Male",
        "hair-color": "Brown",
        "height": [
            "5''8",
            "173 cm"
        ],
        "race": "Mutant",
        "weight": [
            "145 lb",
            "65 kg"
        ]
    },
    "creators": [
        "Jack Kirby",
        "Stan Lee"
    ],
    "deck": "The youngest member of the original X-Men. Bobby is an Omega-level mutant, although it took some help from Emma Frost to realize this. Bobby''s control of ice is vast; he can create shields, clones, spikes, slides and also freeze others. He currently teaches at the Jean Grey School for Higher Learning.",
    "description": "OriginJoining the X-MenRobert ''''Bobby'''' Louis Drake was born was born in Floral Park, Long Island, New York into Jewish-Catholic family. His parents are William Drake and Madeline Drake. He was always shivering and one day his mutant powers manifested when he accidentally froze entire pool. Bobby and his parents were very prudent and careful , if Bobby`s secret would expose he would have been in danger. After his 16th birthday together with his girlfriend Judy Harmon , Robert was attacked by bully named Rocky Beasely and his gang. Robert had no choice and used his cryokinetic powers to freeze attackers. People heard about it and started to execute Robert with lynch mob. Local Sheriff stopped lynch and placed Bobby in jail cell for his own protection. Xavier was informed and tasked Cyclops to rescue Bobby. Cyclops offered Bobby to follow him but Drake refused it and two mutant started to fight each other until mobs arrived. Xavier stepped in and psionically removed memories of people al",
    "first_appeared_in_issue": "X-Men",
    "image": "https://www.superherodb.com/pictures2/portraits/10/100/816.jpg",
    "name": "Iceman",
    "real_name": "Robert Louis Drake"
}