{
    "aliases": "Erik Magnus Lehnsherr\r\nThe Master of Magnetism\r\nMax Eisenhardt\r\nPrisoner #214782\r\nThe Creator\r\nWhite Pilgrim\r\nErik the Red\r\nMichael Xavier\r\nGrey King\r\nWhite King\r\nThe Devil",
    "alignment": "bad",
    "api_detail_url": "https://comicvine.gamespot.com/api/character/4005-1441/",
    "appearance": {
        "eye-color": "Grey",
        "gender": "Male",
        "hair-color": "White",
        "height": [
            "6''2",
            "188 cm"
        ],
        "race": "Mutant",
        "weight": [
            "190 lb",
            "86 kg"
        ]
    },
    "creators": [
        "Jack Kirby",
        "Stan Lee"
    ],
    "deck": "Among the most powerful, recognizable, and infamous mutants to inhabit the planet Earth, Magneto was the X-Men''s first major nemesis. Now known as a revolutionist and terrorist, Magneto has fought for the X-Men as many times as he’s been against them.",
    "description": "OriginMagneto''s childhoodThe man that would become known as \"Magneto\" was born Max Eisenhardt in Germany during the 1920''s to a middle class Jewish family. His father, Jakob Eisenhardt, was a World War I veteran and a proud German. The family struggled against discrimination and hardship during the Nazi''s rise to power, the Nuremberg laws, and Kristallnacht. In the early 1930''s, the family fled to Poland, where they were captured during the Nazi invasion and sent to the Warsaw Ghetto. They managed to escape the ghetto, but were captured again. Max''s mother, father, and sister were executed, but Max survived (potentially thanks to an early manifestation of his powers) and was sent to the Auschwitz concentration camp.There, Max became a Sonderkommando, forced to dispose of gas chamber victims. While at the camp, Max was reunited with a girl he had fallen in love with during his school days named Magda. Max and and Magda escaped when Auschwitz was liberated and were soon married. They mov",
    "first_appeared_in_issue": "X-Men",
    "image": "https://www.superherodb.com/pictures2/portraits/10/100/12.jpg",
    "name": "Magneto",
    "real_name": "Max Eisenhardt"
}