{
    "aliases": "Kurt Szardos\nKurt Wagner\nGainsborough\nHerr Indigo\nGreat Boggie\nFuzzy Elf",
    "alignment": "good",
    "api_detail_url": "https://comicvine.gamespot.com/api/character/4005-1461/",
    "appearance": {
        "eye-color": "Yellow",
        "gender": "Male",
        "hair-color": "Indigo",
        "height": [
            "5''9",
            "175 cm"
        ],
        "race": "null",
        "weight": [
            "195 lb",
            "88 kg"
        ]
    },
    "creators": [
        "Dave Cockrum",
        "Len Wein"
    ],
    "deck": "Kurt Wagner is a prominent member of the X-Men and former member and leader of Excalibur. He possessed the Neyaphemian ability of teleportation, as well as incredible agility, wall scaling and a prehensile tail. Nightcrawler is a devout Catholic, contrasting his demonic appearance. He is a highly skilled swordsmen and former circus acrobat.",
    "description": "OriginYoung NightcrawlerKurt Wagner is the product of a love affair between two mutants, both with origins that have never fully been explained. His mother was the terrorist Mystique, who at the time was the wife of Baron Christian Wagner, believed to be the father of Nightcrawler for a long time. In truth, his father is the Neyaphem warlord, Azazel, who had a great master plan to impregnate earth women with his children so he could escape the brimstone dimension.When Nightcrawler was born, the townsfolk were horrified by Mystique'' son''s demonic appearance and so she threw him into a river, shape-shifted into another form and then claimed that she had killed the son and the mother. Azazel would not allow his son to die, so he saved him and gave him to one of his other lovers (and servant) Margali Szardos to raise. Margali tells a different tale to hide the truth and says that Nightcrawler was discovered by her when she was walking by his house. She discovered his father, Eric Wagner, h",
    "first_appeared_in_issue": "Deadly Genesis",
    "image": "https://www.superherodb.com/pictures2/portraits/10/100/107.jpg",
    "name": "Nightcrawler",
    "real_name": "Kurt Wagner"
}