{
    "aliases": "Dr. Pamela Isley\nDr. Paula Irving\nRed\nGreen Piece\nMay Queen\nPammie\nRedhead\nPenelope Ivy\nLilly\nLillain Rose\nIvy Pepper\nPamela Lillian Isley",
    "alignment": "bad",
    "api_detail_url": "https://comicvine.gamespot.com/api/character/4005-1697/",
    "appearance": {
        "eye-color": "Green",
        "gender": "Female",
        "hair-color": "Red",
        "height": [
            "5''6",
            "168 cm"
        ],
        "race": "Human",
        "weight": [
            "110 lb",
            "50 kg"
        ]
    },
    "creators": [
        "Robert Kanigher",
        "Sheldon Moldoff"
    ],
    "deck": "A brilliant botanical biochemist, Pamela Isley is a fervent eco-terrorist out to save the world''s plant life by any means necessary. She often finds herself at odds with Batman, though they have, on occasion, fought on the same side.",
    "description": "Current Events: The New 52Poison Ivy being rebornFollowing the 2011 reboot of the DC Universe, Poison Ivy was unexpectedly asked by Black Canary to join the new Birds of Prey team. Ivy accepted, but her villainous reputation did not sit well with teammates Starling and Katana, both of whom attacked Ivy on first sight. Ivy easily fended off their attacks and became a member of the Birds of Prey. However, Poison Ivy went on to betray the team, along with Batgirl and blackmailed them into helping her with her Eco-terrorism. She was eventually stopped by Katana and booted off the team.Poison Ivy pops us later in Detective Comics, using her plant-based mental-suggestion powers to manipulate Clayface into believing they were husband and wife. Clayface therefore became her enforcer. This too backfired when Batman found a way to counter Ivy''s mind control and restore Clayface to his senses.RotworldIvy and Deadman fight for The Green in the Rotworld sagaWith the march of the army of Rot, Ivy le",
    "first_appeared_in_issue": "Beware of Poison Ivy!, The Perfect Crime - Slightly Imperfect!",
    "image": "https://www.superherodb.com/pictures2/portraits/10/100/757.jpg",
    "name": "Poison Ivy",
    "real_name": "Pamela Lillian Isley"
}