{
    "aliases": "Trigon''s Daughter\nEvil Avatar\nDark Raven\nPride\nRachel Roth \nRaven\nWitch\nRaven Roth",
    "alignment": "bad",
    "api_detail_url": "https://comicvine.gamespot.com/api/character/4005-3584/",
    "appearance": {
        "eye-color": "Brown",
        "gender": "Male",
        "hair-color": "Black",
        "height": [
            "6''3",
            "191 cm"
        ],
        "race": "Human",
        "weight": [
            "220 lb",
            "99 kg"
        ]
    },
    "creators": [
        "George Pérez",
        "Marv Wolfman"
    ],
    "deck": "Raven battles the forces of evil alongside her adoptive family, the Teen Titans while trying to control her baser, antagonistic instincts she inherited from her demonic father, Trigon.",
    "description": "OriginThe Daughter of TrigonRaven is one of the longest-serving members of the Teen Titans, in various incarnations of the team. Raven owes her heroic role (as well as an evil role) to a darker past - she is the daughter of a human mother named Arella and an inter-dimensional demon known as Trigon. Raven''s demonic lineage was hidden from her for most of her early years. She was raised in an alternate dimension called Azarath, where she learned with a greater degree of skill to control her emotions by the goddess Azar. This was intended to control the influence of Trigon on Earth as her demonic powers would facilitate his ability to conquer the planet. Due to this training, she rarely saw her mother and the two grew apart. Upon Azar''s death, she discovered for the first time her demonic heritage as she met her father face-to-face for the first time. This eventually caused her to leave Azarath and take residence on Earth where, after being rejected by the Justice League of America, she h",
    "first_appeared_in_issue": "Between Friend and Foe; Where Nightmares Begin; Whatever Happened to Sargon the Sorcerer",
    "image": "https://www.superherodb.com/pictures2/portraits/10/100/1034.jpg",
    "name": "Raven",
    "real_name": "Raven"
}