{
    "aliases": "Wanda Maximoff\nWanda Frank\nGypsy Witch\nAna Maximoff\nHigh Priestess\nSister Wanda\nWanda Lensherr\nWanda Magnus\nThe Witch\nScarlet\nWitchfire (Avataar counterpart)",
    "alignment": "bad",
    "api_detail_url": "https://comicvine.gamespot.com/api/character/4005-1466/",
    "appearance": {
        "eye-color": "Blue",
        "gender": "Female",
        "hair-color": "Brown",
        "height": [
            "5''7",
            "170 cm"
        ],
        "race": "Mutant",
        "weight": [
            "132 lb",
            "59 kg"
        ]
    },
    "creators": [
        "Jack Kirby",
        "Stan Lee"
    ],
    "deck": "The world knows Wanda Maximoff as the Scarlet Witch, with probability manipulation and reality-warping abilities. Twin sister of Quicksilver, mother to Wiccan and Speed, and ex-wife of the Vision; Wanda has taken on many roles throughout her life but will forever be known for causing the Decimation. ",
    "description": "OriginThe Scarlet Witch (real name Wanda Maximoff) is a human with the ability to alter probability. For a time, she was believed to be the daughter of the mutant Magneto and his late Roma wife Magda. Wanda is also the fraternal twin sister of Pietro (Quicksilver); she was born first of the two. Wanda and her brother are both Romani and Jewish. Shortly after Magda became pregnant, she witnessed her husband use his magnetic powers and realized that he was a mutant. Being terrified of mutants, Magda did not tell him about her pregnancy and fled from their home at the first opportunity. Magda eventually found refuge with a benevolent cow-like humanoid named Bova, who lived on Mount Wundagore in Transia. The twins were born on Mt. Wundagore, and due to the mountain''s mystical energy, it gave Wanda the ability to use magic in addition to her other powers. Shortly after the birth, Magda was driven mad with fear that Magneto might come for her and discover the twins. Despite Bova''s attempts t",
    "first_appeared_in_issue": "The Brotherhood of Evil Mutants",
    "image": "https://www.superherodb.com/pictures2/portraits/10/100/444.jpg",
    "name": "Scarlet Witch",
    "real_name": "Wanda Marya Maximoff"
}