{
    "aliases": "Princess Koriand''r \r\nKory Anders\r\nKory\r\nKori\r\nNova\r\nStar",
    "alignment": "good",
    "api_detail_url": "https://comicvine.gamespot.com/api/character/4005-2389/",
    "appearance": {
        "eye-color": "Green",
        "gender": "Female",
        "hair-color": "Auburn",
        "height": [
            "6''4",
            "193 cm"
        ],
        "race": "Tamaranean",
        "weight": [
            "158 lb",
            "71 kg"
        ]
    },
    "creators": [
        "George Pérez",
        "Marv Wolfman"
    ],
    "deck": "Formerly warrior Princess Koriand''r of the now-destroyed planet Tamaran, Starfire found a new home on Earth and a new family in the Teen Titans. She was once romantically involved with Dick Grayson, and often dealt with hostilities from her older sister Blackfire. Starfire has also served with many other teams such as the Outsiders, Justice League, R.E.B.E.L.S. and Jason Todd''s Outlaws.",
    "description": "This page is for Koriand''r, the current and most prominent Starfire.For the earlier character with the same name, see: Starfire.OriginStarfire, warrior princessKoriand''r was the second of three children born to King Myand''r and Queen Luand''r of the planet Tamaran, whose inhabitants have the ability to absorb solar energy through their skin and convert it into the power of flight. Her elder sister Komand''r (later known as Blackfire) was the victim of a rare childhood disease that rendered her unable to fly. Komand''r developed a bitter and unpleasant personality as a result, and due to her disability and unpopularity, she was deemed unworthy of ascension to the throne. Komand''r''s princess status was transferred to her more attractive younger sister Koriand''r, who had no abnormalities and was well-liked by her people.Koriand''r received all of the privileges, honors, and dignity of royalty and grew to be the first princess of Tamaran in a hundred years, while Komand''r was largely shunned a",
    "first_appeared_in_issue": "Between Friend and Foe; Where Nightmares Begin; Whatever Happened to Sargon the Sorcerer",
    "image": "https://www.superherodb.com/pictures2/portraits/10/100/786.jpg",
    "name": "Starfire",
    "real_name": "Koriand''r"
}