{
    "aliases": "Beautiful Windrider\r\nBloodstorm\r\nGoddess of the Plains\r\nHigh Priestess\r\nLa Reine Storm\r\nMistress of the Elements\r\nHeadmistress Ororo\r\nMutate #20\r\nOrordius\r\nOroro Iqadi T''Challa\r\nOroro Komos Wakandas\r\nOroro Munroe\r\nQueen Ororo\r\nWeather Witch\r\nWhite Queen\r\nThor",
    "alignment": "good",
    "api_detail_url": "https://comicvine.gamespot.com/api/character/4005-1444/",
    "appearance": {
        "eye-color": "Brown",
        "gender": "Male",
        "hair-color": "Black",
        "height": [
            "-",
            "0 cm"
        ],
        "race": "null",
        "weight": [
            "- lb",
            "0 kg"
        ]
    },
    "creators": [
        "Dave Cockrum",
        "Len Wein"
    ],
    "deck": "Gifted with the power to control the elemental forces and energies that govern the weather, ranging from the nervous system and elements present within living beings to planetary atmospheres and the depths of space, Ororo Munroe also known as Storm or The Hadari Yao is an Omega Level Mutant and Wakandan goddess, solidifying her place as one of the strongest members of the X-men and one of the most powerful beings on Earth. ",
    "description": "OriginMistress of the ElementsStorm (Ororo Munroe) is a descendant of an ancient royal line of white-haired, blue-eyed sorceresses (possibly mutants), who''s defining physical features surface every five generations. Her royal heritage can be traced back to the dawn of humanity. Her family''s kingdom lies hidden in the Great Rift Valley of Africa, the valley that spawned the human race itself. The power in her family is transferred from mother to daughter. Her mother, Princess N''Dare, rebelled against their tradition as she felt that she was forced into the role that was expected of her. She then married an American photojournalist, David Munroe, and lived in Manhattan. They then moved to Cairo, Egypt when Ororo was still an infant. When Ororo was five, she and her family were caught in an Arab-Israeli conflict. Her parents were killed and Ororo ended up buried under rubble next to her mother''s body. Because of this, Ororo has since had a life long struggle attempting to overcome her sev",
    "first_appeared_in_issue": "Deadly Genesis",
    "image": "https://www.superherodb.com/pictures2/portraits/10/100/689.jpg",
    "name": "Storm",
    "real_name": "Ororo Munroe"
}