{
    "aliases": "Kara Zor-El\r\nKara-El\r\nKara Kent\r\nCara Kent\r\nLinda Lee\r\nGirl of Steel\r\nFlamebird\r\nClaire Connors\r\nLinda Lang\r\nLinda Lee Danvers\r\nBluebird\r\nKara In-Ze\r\nMaid of Might\r\nUnknown Boy\r\nSuperman''s Cousin\r\nSuperniña\r\nKara Danvers",
    "alignment": "good",
    "api_detail_url": "https://comicvine.gamespot.com/api/character/4005-2351/",
    "appearance": {
        "eye-color": "Blue",
        "gender": "Female",
        "hair-color": "Blond",
        "height": [
            "5''5",
            "165 cm"
        ],
        "race": "Kryptonian",
        "weight": [
            "120 lb",
            "54 kg"
        ]
    },
    "creators": [
        "Al Plastino",
        "Otto Binder"
    ],
    "deck": "Kara Zor-El is Superman''s cousin and last survivor of Krypton''s Argo City. She has a brash and defiant personality that she developed in response to the destruction of Krypton. Currently, she is operating out of National City alongside the D.E.O.",
    "description": "This is the page for the 1st and current Supergirl, Kara Zor-El. There have been a number of others who have taken up her mantle though.2nd Supergirl: Matrix3rd Supergirl: Linda Danvers4th Supergirl: Cir-ElEarth-2 Supergirl: Power GirlOrigin: The New 52(in Supergirl #0, Nov 2012 and Supergirl #1, Nov 2011)Kara on KryptonOn Krypton, in Argo City, as the planet was in its last dying days, Kara''s father, Zor-El, had taken his brother, Jor-El''s research to heart. He believed, where the Science Council did not, that the planet was dying. Kara''s trials were coming up soon, where she would take part in ceremonies and tests that would usher her into full adulthood in the eyes of Kryptonian society.Zor-El planned to save all of Argo City with devices disguised as power generators that he had convinced the Science Council to place around the city, but he was not willing to risk his daughter in that plan because he wasn''t sure it would succeed. That being the case, he constructed a pod similar to",
    "first_appeared_in_issue": "The Menace of Metallo!; Congo Bill Dies at Dawn!; The Supergirl From Krypton!",
    "image": "https://www.superherodb.com/pictures2/portraits/10/100/790.jpg",
    "name": "Supergirl",
    "real_name": "Kara Zor-El"
}