{
    "aliases": "Benjamin J. Grimm\r\nBen Grimm\r\nBlackbeard the Pirate\r\nThe Ever-Lovin'' Blue-Eyed Thing\r\nBashful Benjy\r\nDr. Josiah Verpoorten\r\nUncle Benjy\r\nIdol of Millions \r\nGrim Ben\r\nThe Thing\r\nEl Morrito\r\nRocky Grimm\r\nAngrir: Breaker of Souls\r\nDing\r\nCount Crag",
    "alignment": "good",
    "api_detail_url": "https://comicvine.gamespot.com/api/character/4005-2114/",
    "appearance": {
        "eye-color": "Red",
        "gender": "Male",
        "hair-color": "No Hair",
        "height": [
            "7''0",
            "213 cm"
        ],
        "race": "null",
        "weight": [
            "500 lb",
            "225 kg"
        ]
    },
    "creators": [
        "Jack Kirby",
        "Stan Lee"
    ],
    "deck": "Ben Grimm, better known as the Thing, is the original quintessential tough-guy of the Marvel Universe. But, because of his transformation, he''s also the tragic member of the Fantastic Four. Ben was an ace test-pilot until exposure to intense cosmic radiation mutated him into a rock-skinned monster with immense superhuman strength. Ben''s exterior is much harder than stone which gives him a rather gruff disposition; but deep down, he has a heart of gold.",
    "description": "OriginCosmic Rays!Benjamin Jacob Grimm was born on Yancy Street in the heart of New York City into a poor Jewish family. When Ben was a young kid his older brother, Daniel Grimm, was the leader of the Yancy Street Gang, a group of young trouble-makers from the area. When he was old enough Ben joined this gang as well. He was inducted into the gang by being ‘beaten in.’ Growing up poor along with his gang affiliation and related activities made Ben street-smart, tough and ''hard'' very early in life. All of these personality characteristics have served him well throughout his lifetime of brawling and adventuring.During Ben''s formative years tragedy struck his family hard; his older brother Daniel was killed in a gang fight when Ben was still a kid and his parents Daniel, Sr. and Elsie both died in an accident when he was a teenager. Ben was placed in the custody of his Uncle Jake (his father''s brother) and Aunt Alyce (Jake''s first wife) who took him from New York to Arizona. Unfortunately",
    "first_appeared_in_issue": "The Fantastic Four!",
    "image": "https://www.superherodb.com/pictures2/portraits/10/100/382.jpg",
    "name": "Thing",
    "real_name": "Benjamin Jacob Grimm"
}