{
    "aliases": "Crimson Cowl\r\nThe Space Knight\r\nThe Vision\r\nTurino XL\r\nUltron-5\r\nUltron-6\r\nUltron-7\r\nUltron-8\r\nUltron-11\r\nUltron-12\r\nUltron-Mark 12\r\nUltron-13\r\nUltron-14\r\nUltron-15\r\nUltron Pym\r\nHank Pym",
    "alignment": "bad",
    "api_detail_url": "https://comicvine.gamespot.com/api/character/4005-2242/",
    "appearance": {
        "eye-color": "Red",
        "gender": "Male",
        "hair-color": "-",
        "height": [
            "6''9",
            "206 cm"
        ],
        "race": "Android",
        "weight": [
            "735 lb",
            "331 kg"
        ]
    },
    "creators": [
        "John Buscema",
        "Roy Thomas"
    ],
    "deck": "Created by Henry Pym to be a technological landmark, Ultron soon intellectually surpassed his \"father\" and eventually fought the Avengers after organizing the Masters of Evil. He has clashed with the Avengers numerous times, driven by his hatred of all organic life and his desire to witness its total destruction. ",
    "description": "OriginThe Birth of UltronUltron was created by Dr. Henry Pym, based upon his own thought and memory engrams. It was a foray into Artificial Intelligence that no scientist had ever taken before, not even Reed Richards. It started out as simply a box on treads with what appeared to be a head at the top. Dubbing the A.I. as Ultron-1, he hoped this represented a new era in scientific discovery. However something went horribly wrong, and Ultron became more than sentient and rebelled against his programming. He also defeated and then brainwashed Dr. Pym into forgetting that he had ever created him in the first place.Character CreationFirst appearance.Ultron was created by Roy Thomas and John Buscema; and first appeared unnamed in The Avengers Vol.1 issue 54 (1968) and was named one issue later in issue 55 of the same series.Major Story ArcsMasters of EvilCrimson Cowl''s identity revealed.Ultron took on the guise of the Crimson Cowl and formed the Masters of Evil to battle against his creator ",
    "first_appeared_in_issue": "And Deliver Us From--The Masters of Evil",
    "image": "https://www.superherodb.com/pictures2/portraits/10/100/1339.jpg",
    "name": "Ultron",
    "real_name": "Ultron"
}