{
    "aliases": "Ant-Man\r\nDoctor Pym\r\nGoliath\r\nScientific Adventurer\r\nScientist Supreme\r\nThe Wasp\r\nYellowjacket\r\nGigantus\r\nGiant Man\r\nHenry Christopher Pym\r\nUltron",
    "alignment": "good",
    "api_detail_url": "https://comicvine.gamespot.com/api/character/4005-2247/",
    "appearance": {
        "eye-color": "Blue",
        "gender": "Male",
        "hair-color": "Blond",
        "height": [
            "6''11",
            "211 cm"
        ],
        "race": "Human",
        "weight": [
            "270 lb",
            "122 kg"
        ]
    },
    "creators": [
        "Jack Kirby",
        "Larry Lieber",
        "Stan Lee"
    ],
    "deck": "Hank Pym is a scientific genius, a founding member of the Avengers, the creator of Pym Particles and of Ultron, and a modern-day superhero who suffers from a Bipolar disorder. He has acted under many memorable identities such as Ant-Man, Giant Man, Goliath, Yellowjacket, and the Wasp. He is also the Earths Scientist Supreme, as decreed by Eternity.",
    "description": "OriginHank Pym has held several identities.Dr. Henry Christopher \"Hank\" Pym grew up with an ordinary family in Nebraska. His family was poor, which led to his father complaining why he couldnt invent something useful instead. The only one who drove Hank to follow his imagination was his grandma. He was an ordinary, but brilliant, young biochemist until his wife, Maria Trovaya, was murdered on a trip to Hungary. Devastated by the loss of his wife, Hank suffered his first mental breakdown. After recovering, he decided to focus his scientific work on things that could help him battle inhumanity and injustice. This new focus eventually lead him to discover a rare group of particles that could be used to alter someones size. Thus Pym Particles were discovered.CreationHank Pym was created by Stan Lee, co-created and drawn by Jack Kirby, and scripted by Larry Lieber. He first appeared as Hank Pym in the horror story \"The Man In The Ant Hill!\" in Tales to Astonish issue 27 (Jan. 1962). His f",
    "first_appeared_in_issue": "The Man In The Ant Hill!",
    "image": "https://www.superherodb.com/pictures2/portraits/10/100/857.jpg",
    "name": "Hank Pym",
    "real_name": "Henry Christopher Pym"
}