{
    "aliases": "Orin\r\nAquafresh\r\nAquaman\r\nKing Arthur\r\nKing of Atlantis\r\nSwimmer\r\nWaterbearer\r\nAquatic Ace\r\nDweller-in-the Depths\r\nEmperor Aquaman\r\nHeir to the throne of Atlantis\r\nKing of the Seven Seas \r\nKing Orin\r\nLord of the Deep\r\nMarine Marvel\r\nAtlan-Son",
    "alignment": "good",
    "api_detail_url": "https://comicvine.gamespot.com/api/character/4005-2357/",
    "appearance": {
        "eye-color": "Blue",
        "gender": "Male",
        "hair-color": "Blond",
        "height": [
            "6'1",
            "185 cm"
        ],
        "race": "Atlantean",
        "weight": [
            "325 lb",
            "146 kg"
        ]
    },
    "creators": [
        "Mort Weisinger",
        "Paul Norris"
    ],
    "deck": "The son of an Atlantean queen and a lighthouse keeper from the town of Amnesty Bay, Arthur Curry would grow up to become the superhero Aquaman, and later take on his birthright as the King of Atlantis. He is a founding member of the Justice League and is among DC Comics' most recognized heroes.",
    "description": "OriginAccording to his first origin story, Aquaman aka Arthur Curry was the son of Atlanna, an Atlantean princess banished from Atlantis due to her interest in and frequent visits to the surface world, and Tom Curry, a lighthouse keeper living in Amensty Bay, Maine. Both parents first meet each during a terrible storm one night, when Curry finds Atlanna thrown up on the shore by storm-tossed waves, and rescues her from harm. Both Curry and Atlanna made the lighthouse their home and developed a strong bond that would quickly lead to a sentimental relationship when Arthur was born. Although Curry always knew there was more to his wife than she would let on, he'd never ask her about her origins.Arthur grew up making his presence in life irrelevant than most children, further cementing the bond between his parents. By age two, he was found by his father playing underwater after he had apparently been there for an hour without drowning. Several years later, both Tom and his father learn the",
    "first_appeared_in_issue": null,
    "image": "https://www.superherodb.com/pictures2/portraits/10/100/634.jpg",
    "name": "Aquaman",
    "real_name": "Arthur Curry"
}