{
    "aliases": "Bruce Wayne\r\nThe Caped Crusader\r\nThe Dark Knight\r\nThe World's Greatest Detective\r\nThe Dark Knight Detective\r\nMatches Malone\r\nGotham Knight\r\nDetective\r\nBats\r\nThe Bat\r\nMaster Wayne\r\nKnight of Vengeance\r\nThe Goddamn Batman\r\nJack Shaw\r\nGod of Knowledge\r\nInsider\r\nMordecai Wayne\r\nArchivist\r\nNero Nykto\r\nMayor Wayne\r\nBruno Diaz\r\nBruce Thomas Wayne",
    "alignment": "good",
    "api_detail_url": "https://comicvine.gamespot.com/api/character/4005-1699/",
    "appearance": {
        "eye-color": "Blue",
        "gender": "Male",
        "hair-color": "Black",
        "height": [
            "5'10",
            "178 cm"
        ],
        "race": "Human",
        "weight": [
            "170 lb",
            "77 kg"
        ]
    },
    "creators": [
        "Bill Finger",
        "Bob Kane"
    ],
    "deck": "Bruce Wayne, who witnessed the murder of his billionaire parents as a child, swore to avenge their deaths. He trained extensively to achieve mental and physical perfection, mastering martial arts, detective skills, and criminal psychology. Costumed as a bat to prey on the fears of criminals, and utilizing a high-tech arsenal, he became the legendary Batman.",
    "description": "Current Events Batman  - Batman has escaped his knightmares, only to find himself locked up in Arkham with his worst enemies.Detective Comics - Batman is searching for Damian who was kidnapped by the Arkham Knight.Justice League - Batman, along with the rest of the league is trapped in the sixth dimension by the World forger.OriginYoung Bruce grieving over his parents' bodiesA wealthy philanthropist, Thomas Wayne, his wife, Martha, and their 8-year-old son, Bruce Wayne, were coming out of a movie theater at 10:47 p.m. As they stepped onto Park Row (now called Crime Alley), a thug called Joe Chill, armed with a gun, approached them from the shadows to steal the pearl necklace Martha was wearing. Thomas, moving in to protect his wife, was shot and killed by Chill, causing Martha to scream in terror. Chill then shot and killed her, while shouting, \"This'll shut you up!\" Bruce, traumatized by the deaths of his parents, would never be the same again.Afterwards, Bruce was raised by his wise ",
    "first_appeared_in_issue": "The Case of the Chemical Syndicate",
    "image": "https://www.superherodb.com/pictures2/portraits/10/100/10441.jpg",
    "name": "Batman",
    "real_name": "Bruce Wayne"
}