{
    "aliases": "King T'Challa\r\nThe Most Dangerous Man Alive\r\nKing of Wakanda\r\nThe Client\r\nHis Majesty\r\nThe Panther of Wakanda\r\nUkatana\r\nCoal Tiger\r\nNubian Prince\r\nThe Man Without Fear\r\nThe Jungle Avenger\r\nKing Of The Dead\r\nLucas Charles\r\nOrphan-King\r\nHaramu-Fal\r\nDamisa-Sarki",
    "api_detail_url": "https://comicvine.gamespot.com/api/character/4005-1477/",
    "creators": [
        "Jack Kirby",
        "Stan Lee"
    ],
    "deck": "T'Challa is the Black Panther, king of Wakanda, one of the most technologically advanced nations on Earth. He is among the top intellects and martial artists of the world, a veteran Avenger, and a member of the Illuminati. Using his powers and abilities, he has pledged his fortune, powers, and life to the service of all mankind.",
    "description": "OriginAll monarchs of Wakanda are known as \"Black Panther.\"Long ago, a huge meteorite made of a rare mineral now known as vibranium, crashed landed in Wakanda. The first king of Wakanda, Black Panther Bashenga, harnessed the mineral and used it to nurture his nation. Thousands of years later, under the ruling of Black Panther T‘Chaka, Wakanda's level of technological and economic achievements continued to excel far beyond those of the modern world.T'Chaka concealed Wakanda from the rest of world to prevent it from being manipulated by outsiders. His first wife, N'Yami, died while in labor with Prince T’Challa. Years later, a Dutch scientist named Ulysses Klaw found a way into Wakanda, created a vibranium sound-based weapon, and used it to kill King T’Chaka. Prince T’Challa, only a child at the time, managed to turn the sound weapon on Klaw, destroying his right hand. Klaw fled the country, exposed Wakanda to the outside world, and vowed revenge.Prince T'Challa would later become king a",
    "first_appeared_in_issue": "Introducing the Sensational Black Panther",
    "image": "https://comicvine1.cbsistatic.com/uploads/scale_medium/3/31666/5011137-blap2016001-cov-d6d2a.jpg",
    "name": "Black Panther",
    "real_name": "T'Challa"
}