{
    "aliases": "Selina Kyle\r\nSelina Falcone\r\nSelina Wayne\r\nBatwoman\r\nBelinda\r\nElva Barr\r\nIrena Dubrovna\r\nKitty Grimalkin\r\nMadame Moderne\r\nMarguerite Tone\r\nRoxy Rocket\r\nSadie Kelowski\r\nThe Cat\r\nThe Cat Burglar \r\nCatbird",
    "alignment": "good",
    "api_detail_url": "https://comicvine.gamespot.com/api/character/4005-1698/",
    "appearance": {
        "eye-color": "Green",
        "gender": "Female",
        "hair-color": "Black",
        "height": [
            "5'9",
            "175 cm"
        ],
        "race": "Human",
        "weight": [
            "135 lb",
            "61 kg"
        ]
    },
    "creators": [
        "Bill Finger",
        "Bob Kane"
    ],
    "deck": "Catwoman, the costumed alias persona of Selina Kyle, is a cat burglar with an on-again, off-again, romantic relationship with Batman. She is shown as a woman who is very strong-willed, independent and morally dubious.",
    "description": "OriginThe CatwomanThere have been many versions of Catwoman's origin over the years but details of her possible storyline suggested that Selina Kyle was born to Brian and Maria Kyle in the slums of Gotham City. Her mother was never close to Selina or her sister Maggie and would often rather spend time with her cats then her children. Her father was an abusive and drunken man who would always quarrel with Maria, a homemaker. In her spare time, Selina took gym lessons not just as an extra curricular, but to sometimes avoid the domestic violence at home. One day, as she returned home from school, Selina found her mother lying in the bath tub filled with blood. Apparently, Maria had committed suicide by cutting her wrists with a razor blade. Selina’s father hated Selina because she looked like her mother, eventually he drank too much and succumbed to alcohol poisoning. Selina called the police but as soon she hung up the phone, she packed her bag and ran away from home.A young Selina caugh",
    "first_appeared_in_issue": "The Legend of the Batman: Who He Is and How He Came To Be; The Joker",
    "image": "https://www.superherodb.com/pictures2/portraits/10/100/659.jpg",
    "name": "Catwoman",
    "real_name": "Selina Kyle"
}