{
    "aliases": "Wade Wilson\r\nThe Merc with a Mouth\r\nThe Crimson Comedian\r\nThe Regeneratin' Degenerate\r\nWade T. Wilson\r\nChiyanosake (\"Wolf of the Rice Wine\")\r\nThom Cruz\r\nChatterbox\r\nWildcard\r\nPeter Parker\r\nTalking Man\r\nJohnny Silvini\r\nMithras\r\nHobgoblin\r\nDenny\r\nRhodes\r\nLo",
    "alignment": "neutral",
    "api_detail_url": "https://comicvine.gamespot.com/api/character/4005-7606/",
    "appearance": {
        "eye-color": "Brown",
        "gender": "Male",
        "hair-color": "No Hair",
        "height": [
            "6'2",
            "188 cm"
        ],
        "race": "Mutant",
        "weight": [
            "210 lb",
            "95 kg"
        ]
    },
    "creators": [
        "Fabian Nicieza",
        "Rob Liefeld"
    ],
    "deck": "Wade Wilson is a former test subject of the Weapon X program, where he received his regenerative healing factor through the scientific experiments conducted upon him. Deadpool's powers and personality traits combine to make a wild, mentally unstable, and unpredictable mercenary. Deadpool has been a member of X-Force and the Thunderbolts, and a self-professed member of the X-Men and the Avengers. The \"Merc with a Mouth\" is infamous for breaking the fourth wall.",
    "description": "OriginWade's official handbook appearance.Wade Wilson was born as a normal person into a highly dysfunctional family in a small town in the state of Ohio. He ran away as a teenager and bounced around the country, all the while getting military training from various sources until he decided to become a mercenary. He kept changing his identity whenever something went wrong with the mission. He moved to Canada where he met a man by the name of Wade T. Wilson. Since he was Wade W. Wilson, the name reminded him of his old self. When he was ordered to assassinate Wade T., he accidentally killed the target's wife, Mercedes. In the end, Wade T. ran away to eventually become the voodoo mercenary T-Ray while Wade W. kept the name \"Wade T. Wilson\" and never changed it out of respect for his namesake's wife. When he was diagnosed with inoperable brain cancer, he volunteered for a subset of the Weapon-X program that was attempting to imbue a normal human with Wolverine’s healing factor.Since he is ",
    "first_appeared_in_issue": "The Beginning of the End Part One",
    "image": "https://www.superherodb.com/pictures2/portraits/10/100/835.jpg",
    "name": "Deadpool",
    "real_name": "Wade Winston Wilson"
}