{
    "aliases": "Bruce Banner\r\nThe Incredible Hulk\r\nThe Incredible Thing\r\nDr. Banner\r\nDavid Banner\r\nDavid Blaine\r\nBruce Bancroft\r\nDavid Bixby\r\nBob Danner\r\nBreaker of Worlds\r\nBruce Roberts\r\nPuny Banner\r\nJoe Fixit\r\nMr. Fixit\r\nScartacus\r\nAnnihilator\r\nJade Giant\r\nJade Jaws\r\nDoc Green\r\nWorld Breaker\r\nGreen Scar\r\nEye of Anger\r\nHarkanon\r\nHaarg\r\nHolku\r\nGreen King",
    "alignment": "good",
    "api_detail_url": "https://comicvine.gamespot.com/api/character/4005-2267/",
    "appearance": {
        "eye-color": "Green",
        "gender": "Male",
        "hair-color": "Green",
        "height": [
            "8''0",
            "244 cm"
        ],
        "race": "Human / Radiation",
        "weight": [
            "1400 lb",
            "630 kg"
        ]
    },
    "creators": [
        "Jack Kirby",
        "Stan Lee"
    ],
    "deck": "After being bombarded with a massive dose of gamma radiation while saving a young mans life during the testing of an experimental bomb, Dr. Robert Bruce Banner was transformed into the Incredible Hulk: a green behemoth who is the living personification of rage and pure physical strength.",
    "description": "OriginBruce Banner becomes the Incredible HulkRobert Bruce Banner was born to atomic scientist Dr. Brian Banner and his wife, Rebecca. Although deeply loved by his mother, Bruce’s father who was mentally unstable harbored a deep jealousy and hatred for him. Brian was convinced that his work in atomic science had altered his genetic structure and because of this he also feared that Bruce would grow up a genetic freak, when actually, Bruce was just a very gifted and intelligent child. While growing up Bruce was subjected to Brian’s drunken rages and abuse, as was his mother. Tragically, Rebecca was killed by Brian when she attempted to take young Bruce and leave him. His mothers murder and his fathers arrest left Bruce in the care of his aunt, Mrs. Drake, and he grew up a social outcast due to the trauma of being abused by his father as well as witnessing his mother’s abuse and murder at the hands of his father.After graduating high school, Bruce began studying nuclear physics at Deser",
    "first_appeared_in_issue": "The Coming of the Hulk",
    "image": "https://www.superherodb.com/pictures2/portraits/10/100/83.jpg",
    "name": "Hulk",
    "real_name": "Robert Bruce Banner"
}