{
    "aliases": "Reed Richards\r\nInvincible Man\r\nReed Benjamin\r\nRichard Reed\r\nMister Fantastic\r\nBig Brain\r\nStretch\r\nDr. Richards\r\nThe Man in the Mystery Mask\r\nDoctor Doom\r\nMister Elastic\r\nMaker",
    "api_detail_url": "https://comicvine.gamespot.com/api/character/4005-2151/",
    "creators": [
        "Jack Kirby",
        "Stan Lee"
    ],
    "deck": "Reed Richards, also known as Mr. Fantastic, is the leader of the Fantastic Four. He can stretch his body to great distances due to his exposure to cosmic rays while in space. He is also considered to be one of the smartest men alive, using his brain to explore alternate dimensions and save the world alongside his family from science-based threats.",
    "description": "OriginMr. FantasticReed Richards was born in Central City, California and the son of  Nathaniel and  Evelyn Richards. Reed’s father was a brilliant scientific genius and a trait that Reed inherited. Reed excelled in mathematics, physics, and mechanics and was enrolled in college by the age of 14. He went to multiple colleges including Massachusetts Institute of Technology, California Institute of Technology, Harvard University, Columbia University, and  Empire State University. While attending EMU he met and became a roommate of  Ben Grimm. They became great friends and Reed shared his dream of building a spaceship himself.After EMU, Reed continued to go to school at Columbia University, and he rented an apartment from  Sue Storms Aunt. Sue quickly fell in love with Reed. Reed, also met  Victor Von Doom, while attending Columbia University. Doom loved that Reed could rival his intellect. Eventually Doom became jealous of Reed and began conducting reckless experiments that scarred his ",
    "first_appeared_in_issue": "The Fantastic Four!",
    "image": "https://comicvine1.cbsistatic.com/uploads/scale_medium/11141/111413247/7267287-5e956fe5-f8e7-426d-a239-ac3db118f0a5_rw_1200.jpg",
    "name": "Mr. Fantastic",
    "real_name": "Reed Richards"
}