{
    "aliases": "Son of Odin\nScion of Asgard\nThe Odinson\nThe God of Thunder\nThe Thunderer\nLord of Asgard\nThe Mighty Thor\nThe Mighty Avenger\nGoldilocks\nDr. Donald M. Blake\nSigurd Jarlson\nJake Olsen\nDonar the Mighty\nDonner\nArkin Torsen\nEric Masterson\nSiegfried\nSiegmund\nPrin\nThe Son of Gaea\nThe God King\nStorm God\nBeing of Angelic Light\nThe Thunder King\nKing Thor\nHerald of Thunder\nAll-Father\nThe Golden Haired Avenger",
    "alignment": "bad",
    "api_detail_url": "https://comicvine.gamespot.com/api/character/4005-2268/",
    "appearance": {
        "eye-color": "Green",
        "gender": "Male",
        "hair-color": "No Hair",
        "height": [
            "6''2",
            "188 cm"
        ],
        "race": "Human",
        "weight": [
            "210 lb",
            "95 kg"
        ]
    },
    "creators": [
        "Jack Kirby",
        "Stan Lee"
    ],
    "deck": "Thor Odinson is the All-father of Asgard /God of Thunder, offspring of All-Father Odin & the Elder Earth-Goddess Gaea. Combining the powers of both realms makes him an elder-god hybrid and a being of limitless potential. Armed with his enchanted Uru hammer Mjolnir which helps him to channel his godly energies. The mightiest and the most beloved warrior in all of Asgard, a staunch ally for good and one of the most powerful beings in the multiverse/omniverse. Thor is also a founding member of the Avengers.",
    "description": "OriginThor Odinson - Son of Odin, God of Thunder &amp; Prince of Asgard.Thor is the son of Odin, All-father of the Asgardian Gods, and the elder goddess Gaea, the living embodiment of Earth itself. Thor was born centuries ago in a cave in Norway. Once Thor was weened, Odin brought him to Asgard where he was raised to be the God of Thunder and heir to the throne. As the Asgardian God of Thunder, Thor commands the thunder, the lightning the wind and all the elements of the storm with his hammer Mjolnir, which was forged from the legendary, indestructible Asgardian metal; Uru. Mjolnir gives Thor the power of flight and helps him channel, focus or amplify his own godly elemental powers. Though the hammer is quite heavy by mortal standards, It can only be lifted by those deemed worthy to do so, regardless of the would-be wielder’s physical strength. After centuries of defending Asgard from its enemies, Thor became too proud and grew headstrong. It was because of this that he was banished to",
    "first_appeared_in_issue": "The End Of The World!",
    "image": "https://www.superherodb.com/pictures2/portraits/10/100/727.jpg",
    "name": "Thor",
    "real_name": "Thor Odinson"
}