{
    "aliases": "James Howlett\r\nLogan\r\nAgent Ten\r\nBlack Dragon\r\nBrother Xavier\r\nCaptain Canada\r\nCaptain Terror\r\nDeath\r\nEmilio Garra\r\nExperiment X\r\nFist of Legend\r\nHooded Man\r\nJim Logan\r\nJohn Logan\r\nMutate #9601\r\nPatch\r\nPeter Richards\r\nRevolto the Clown\r\nWeapon X",
    "alignment": "good",
    "api_detail_url": "https://comicvine.gamespot.com/api/character/4005-1440/",
    "appearance": {
        "eye-color": "Blue",
        "gender": "Male",
        "hair-color": "Black",
        "height": [
            "5''3",
            "160 cm"
        ],
        "race": "Mutant",
        "weight": [
            "300 lb",
            "135 kg"
        ]
    },
    "creators": [
        "John Romita",
        "Len Wein",
        "Roy Thomas"
    ],
    "deck": "A long-lived mutant with the rage of a beast and the soul of a Samurai, James \"Logan\" Howletts once mysterious past is filled with blood, war and betrayal. Possessing an accelerated healing factor, keenly enhanced senses and bone claws in each hand (along with his skeleton) that are coated in adamantium; Wolverine is, without question, the ultimate weapon.",
    "description": "OriginWolverine emerges.The man who would be known as the superhero named Wolverine was born as James Howlett in the mid 1880s in Alberta, Canada. He was the second and sickly child to Elizabeth and John Howlett Sr. His mother was ill and, in the early 1900s, a young Irish girl named Rose OHara was brought to the Howlett estate to be a friend and a caretaker to young James. Together they befriended a young boy named Dog, son of the grounds keeper, Thomas Logan. Dog tried to form a normal bond between the two, but due to his father’s resentment and drunken abuse, he grew to resent his station in life; so much so that one day he makes undue advances on Rose, which are reported by young James to his father. This whole chain of events leads to Thomas Logan being sacked from his position as groundskeeper, following which he goes seeking for Elizabeth Howlett, trying to convince her to leave with him. This leads to an altercation that results in the death of John Howlett. The shock of seein",
    "first_appeared_in_issue": "And the Wind Howls... Wendigo!",
    "image": "https://www.superherodb.com/pictures2/portraits/10/100/161.jpg",
    "name": "Wolverine",
    "real_name": "James Howlett"
}