{
    "aliases": "Peng Deilan\r\nGreen Snake",
    "api_detail_url": "https://comicvine.gamespot.com/api/character/4005-131297/",
    "creators": [
        "Billy Tan",
        "Gene Luen Yang",
        "Viktor Bogdanovic"
    ],
    "deck": "Peng Deilan is the Green Snake from the ancient Chinese Legend of the White Snake. Frozen in stone for centuries, she was freed by Dr. Omen and the Ministry of Self-Reliance and recruited as the Wonder-Woman of China. Joined by Super-Man and Bat-Man, she was a founding member of the Justice League of China. Her past came back to haunt her though, when Sorcerer Monk Fahai, her ancient enemy, was freed by the China White Triad at the behest of All-Yang, reveling the secrets of her past in the struggle.",
    "description": "CreationPeng Deilan was created by Gene Luen Yang and Viktor Bogdanovic. She now goes by the name Wonder-Woman.  OriginPeng Deilan as Green SnakeAccording to Buddhist sages, all of existence is divided into six realms: Gods, Demigods, Animals, Humans, Ghosts, and Hell. The creatures of each realm cannot move from one realm to another except through death and rebirth; any other attempts would only upset the very order of existence.Long ago, White Snake fell in love with a human boy, but she knew such love cannot exist across realms. So she set her mind on crossing over. Together with her friend, Green Snake, she cultivated her qi to becoming human. Eventually, the snakes achieved their goal and they crossed over into the human realm despite the protest of an old turtle named Fahai, who was secretly infatuated with White Snake. White Snake found the human she loved, but Green Snake also fell in love with the boy as well.Green Snake, White Snake, and the human boy they both fell in love w",
    "first_appeared_in_issue": "Made In China Part One",
    "image": "https://comicvine1.cbsistatic.com/uploads/scale_medium/13/132823/6403360-wonder-woman_%28green_snake%29.jpg",
    "name": "Wonder-Woman",
    "real_name": "Peng Deilan"
}